Now yeah I haven't noticed one error above:

```

Terraform will perform the following actions:

  # aws_db_parameter_group.default will be created
  + resource "aws_db_parameter_group" "default" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "postgresql10.7"
      + id          = (known after apply)
      + name        = "rds-pg"
      + name_prefix = (known after apply)

      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_client"
          + value        = "utf8"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_server"
          + value        = "utf8"
        }
    }

```

and fails with 

```

Error: Error creating DB Parameter Group: InvalidParameterValue: ParameterGroupFamily postgresql10.7 is not a valid parameter group family
        status code: 400, request id: 698e793d-d4f2-4a1e-af96-5d1ad051e01a

  on aws_rds.tf line 8, in resource "aws_db_parameter_group" "default":
   8: resource "aws_db_parameter_group" "default" {

```

And my script i've clearly specified it's `aurora-postgresql` and for the family it should be used "aurora-postgres" , or if not aurora then "postgres", there's no such thing as "postgresql" for db group family on AWS anymore
```